src/cf/AccumulationRegisters/вогПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>вогПродажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Comment>Стоимость без скидок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество_в_единицах_отчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Catalogs/вогНоменклатурныеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогНоменклатурныеПозиции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПродажиПлитка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыПлитки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РектификацияПлитка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыПоверхностиПлитка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыПоверхностиПлитки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалПлитка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дизайн</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогДизайныНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипыИспользованияПлитки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогГруппировкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтингПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРейтингПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодАнонса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтингХолдинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРейтингиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогДизайныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогДизайныНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеновойСегмент</Name>
					<Comment>используется для направления ПЛИТКА</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПлитки</Name>
					<Comment>для ПЛИТКИ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.вогФорматыПлитки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРисункаОбои</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипРисункаОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильРисункаОбои</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСтилиРисункаОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерРисункаОбои</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогРазмерРисункаОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПолосыОбои</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогРазмерПолосыРисункаОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеСтруктурыОбои</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогРасположениеСтруктурыОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоверхностьОбои</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыПоверхностиОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаппортОбои</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдвигОбои</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтруктурыОбои</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогРазмерСтруктурыОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоллекцияПлитки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогКоллекцииПлитки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сорт</Name>
					<Comment>1 или 2</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементРисунка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЭлементыРисункаОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураОбои</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыСтруктурыОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДекорОбои</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыДекораОбоев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильРисункаПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСтильРисункаПроизводителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДизайна</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогТипыДизайна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементРисункаПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЭлементРисункаПроизводителяОбои</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтруктурыПроизводителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВидыСтруктурыПроизводителяОбои</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/AccumulationRegisters/вогПродажи/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ++ VOG Солодов В.В. 22.07.2021 DEV-641
Процедура ПередЗаписью(Отказ, Замещение)
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			СписокНоменклатуры.Добавить(Запись.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНоменклатура.вогПроизводитель КАК Производитель,
	|	ЕСТЬNULL(ТаблицаBSU.Ссылка, ЗНАЧЕНИЕ(Справочник.вогНоменклатурныеПозиции.ПустаяСсылка)) КАК НоменклатурнаяПозиция,
	|	ЕСТЬNULL(ТаблицаДизайны.Бренд, ЗНАЧЕНИЕ(Справочник.вогБренды.ПустаяСсылка)) КАК Бренд,
	|	ЕСТЬNULL(ТаблицаДизайны.НоменклатурнаяГруппа, ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)) КАК НоменклатурнаяГруппа,
	|	ТаблицаНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаЕдиницыИзмерения.Коэффициент, 0) КАК К
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогНоменклатурныеПозиции КАК ТаблицаBSU
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогДизайныНоменклатуры КАК ТаблицаДизайны
	|			ПО ТаблицаBSU.Дизайн = ТаблицаДизайны.Ссылка
	|		ПО ТаблицаНоменклатура.НоменклатурнаяПозиция = ТаблицаBSU.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ТаблицаЕдиницыИзмерения
	|		ПО ТаблицаНоменклатура.ЕдиницаДляОтчетов = ТаблицаЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка В(&СписокНоменклатуры)";
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		тзДанныеНоменклатуры = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не (ЗначениеЗаполнено(Запись.Бренд)
				И ЗначениеЗаполнено(Запись.Производитель)
				И ЗначениеЗаполнено(Запись.НоменклатурнаяГруппа)) Тогда
				
				СтрокаТЗ = тзДанныеНоменклатуры.Найти(Запись.Номенклатура);
				
				Если Не СтрокаТЗ = Неопределено Тогда
					
					Запись.Бренд 				= СтрокаТЗ.Бренд;
					Запись.Производитель 		= СтрокаТЗ.Производитель;
					Запись.НоменклатурнаяГруппа = СтрокаТЗ.НоменклатурнаяГруппа;
					Если СтрокаТЗ.К > 0 Тогда
						Запись.Количество_в_единицах_отчетов = Запись.Количество / СтрокаТЗ.К;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // -- VOG Солодов В.В. 22.07.2021 DEV-641

Процедура ПриЗаписи(Отказ, Замещение)
	
	// ++ VOG Солодов В.В. 22.07.2021 DEV-641
	// До изменения
	//СписокНоменклатуры = Новый СписокЗначений;
	//
	//Для каждого Запись из ЭтотОбъект цикл
	//	Если ЗначениеЗаполнено(Запись.Номенклатура) тогда
	//		СписокНоменклатуры.Добавить(Запись.Номенклатура);		
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Номенклатура.вогПроизводитель КАК Производитель,
	//               |	Номенклатура.НоменклатурнаяПозиция КАК НоменклатурнаяПозиция,
	//               |	Номенклатура.НоменклатурнаяПозиция.Дизайн.Бренд КАК Бренд,
	//               |	Номенклатура.НоменклатурнаяПозиция.Дизайн.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//               |	Номенклатура.Ссылка КАК Номенклатура,
	//               |	Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК К
	//               |ИЗ
	//               |	Справочник.Номенклатура КАК Номенклатура
	//               |ГДЕ
	//               |	Номенклатура.Ссылка В(&СписокНоменклатуры)";
	//
	//Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	//тзДанныеНоменклатуры = Запрос.Выполнить().Выгрузить();
	//Для каждого Запись из ЭтотОбъект цикл
	//	Если ЗначениеЗаполнено(Запись.Номенклатура) тогда
	//		Если НЕ(ЗначениеЗаполнено(Запись.Бренд) и ЗначениеЗаполнено(Запись.Производитель) и ЗначениеЗаполнено(Запись.НоменклатурнаяГруппа)) тогда
	//			СтрокаТЗ = тзДанныеНоменклатуры.Найти(Запись.Номенклатура);
	//			Если СтрокаТЗ<>Неопределено тогда
	//				Запись.Бренд = СтрокаТЗ.Бренд;
	//				Запись.Производитель = СтрокаТЗ.Производитель;
	//				Запись.НоменклатурнаяГруппа = СтрокаТЗ.НоменклатурнаяГруппа;
	//				Если СтрокаТЗ.К>0 тогда
	//					Запись.Количество_в_единицах_отчетов = Запись.Количество / СтрокаТЗ.К;
	//				КонецЕслИ;	
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	// -- VOG Солодов В.В. 22.07.2021 DEV-641
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
